perf/dict.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 300
      arrivalRate: 10
      rampTo: 40
    - name: Plain
      duration: 50
      arrivalRate: 40
    - name: High Plain
      duration: 250
      arrivalRate: 40

  payload:
    path: '../store/static/files/wordlist.csv'
    fields:
      - "word"
    randomize: true

    

scenarios:
  - name: Dictionary
    flow:
      - get:
          url: '/dictionary/{{ word }}'