perf/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 3

    - name: Ramp
      duration: 80
      arrivalRate: 3
      rampTo: 25

    - name: Plain 2
      duration: 180
      arrivalRate: 25

    - name: Slide
      duration: 80
      arrivalRate: 25
      rampTo: 2

    - name: Spike
      duration: 30
      arrivalRate: 40

    - name: Plain 3
      duration: 90
      arrivalRate: 3
    
    

scenarios:
  - name: Ping
    flow:
      - get:
          url: '/ping'