perf/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 100
      arrivalRate: 2
      rampTo: 350
    - name: Plain
      duration: 300
      arrivalRate: 350
    - name: Slide
      duration: 100
      arrivalRate: 350
      rampTo: 5
    - name: Spike
      duration: 50
      arrivalRate: 430
    - name: Plain 2
      duration: 50
      arrivalRate: 200
    
    

scenarios:
  - name: Ping
    flow:
      - get:
          url: '/ping'