perf/quote.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 100
      arrivalRate: 1
      rampTo: 15
    - name: Plain
      duration: 200
      arrivalRate: 15
    - name: Ramp 2
      duration: 100
      arrivalRate: 15
      rampTo: 25
    - name: Slide
      duration: 50
      arrivalRate: 25
      rampTo: 10
    - name: Spike
      duration: 100
      arrivalRate: 30    
    

scenarios:
  - name: Quote
    flow:
      - get:
          url: '/quote'