perf/space.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 50
      arrivalRate: 1
      rampTo: 2
    - name: Plain
      duration: 100
      arrivalRate: 2
    - name: Spike
      duration: 20
      arrivalRate: 4
    - name: Plain 2
      duration: 230
      arrivalRate: 2
    - name: Slide
      duration: 200
      arrivalRate: 3
      rampTo: 1
      
    

scenarios:
  - name: Space
    flow:
      - get:
          url: '/spaceflight_news'