perf/space.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 100
      arrivalRate: 10
    - name: Spike
      duration: 100
      arrivalRate: 30
    - name: Plain 2
      duration: 200
      arrivalRate: 10
    - name: Slide
      duration: 200
      arrivalRate: 35
      rampTo: 10
      
    

scenarios:
  - name: Space
    flow:
      - get:
          url: '/spaceflight_news'